In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db

In [10]:
%%sql
Select name 
from sqlite_master
where type='table'

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('authors',),
 ('discounts',),
 ('employee',),
 ('jobs',),
 ('pub_info',),
 ('publishers',),
 ('roysched',),
 ('sales',),
 ('stores',),
 ('titleauthor',),
 ('titles',)]

#### Explore sales table

In [11]:
%%sql
Select *
from sales
limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('6380', '6871', '1994-09-14 00:00:00', 5, 'Net 60', 'BU1032'),
 ('6380', '722a', '1994-09-13 00:00:00', 3, 'Net 60', 'PS2091'),
 ('7066', 'A2976', '1993-05-24 00:00:00', 50, 'Net 30', 'PC8888'),
 ('7066', 'QA7442.3', '1994-09-13 00:00:00', 75, 'ON invoice', 'PS2091'),
 ('7067', 'D4482', '1994-09-14 00:00:00', 10, 'Net 60', 'PS2091')]

#### Explore roysched table

In [12]:
%%sql
Select *
from roysched
limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('BU1032', 0, 5000, 10),
 ('BU1032', 5001, 50000, 12),
 ('PC1035', 0, 2000, 10),
 ('PC1035', 2001, 3000, 12),
 ('PC1035', 3001, 4000, 14)]

In [13]:
%%sql
Select *
from titles

limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00'),
 ('BU1111', 'Cooking with Computers: Surreptitious Balance Sheets', 'business', '1389', 11.95, 5000, 10, 3876, 'Helpful hints on how to use your electronic resources to the best advantage.', '1991-06-09 00:00:00'),
 ('BU2075', 'You Can Combat Computer Stress!', 'business', '0736', 2.99, 10125, 24, 18722, 'The latest medical and psychological techniques for living with the electronic office. Easy-to-understand explanations.', '1991-06-30 00:00:00'),
 ('BU7832', 'Straight Talk About Computers', 'business', '1389', 19.99, 5000, 10, 4095, 'Annotated analysis of what computers can do for you: a no-hype guide for the critical user.', '1991-06-22 00:00:00'),
 ('MC2222', 'Silicon Valley Gastronomic Treats', 'mod_cook', '0877', 19.99, 0, 12, 2032, 'Favorite recipes for quick, easy, and elegant meals.', '1991-06-09 00:00:00')]

In [14]:
%%sql
Select *
from authors

limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('172-32-1176', 'White', 'Johnson', '408 496-7223', '10932 Bigge Rd.', 'Menlo Park', 'CA', '94025', 1),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1),
 ('238-95-7766', 'Carson', 'Cheryl', '415 548-7723', '589 Darwin Ln.', 'Berkeley', 'CA', '94705', 1),
 ('267-41-2394', "O'Leary", 'Michael', '408 286-2428', '22 Cleveland Av. #14', 'San Jose', 'CA', '95128', 1),
 ('274-80-9391', 'Straight', 'Dean', '415 834-2919', '5420 College Av.', 'Oakland', 'CA', '94609', 1)]

In [15]:
%%sql
Select *
from titleauthor

limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('172-32-1176', 'PS3333', 1, 100),
 ('213-46-8915', 'BU1032', 2, 40),
 ('213-46-8915', 'BU2075', 1, 100),
 ('238-95-7766', 'PC1035', 1, 100),
 ('267-41-2394', 'BU1111', 2, 40)]

#### Joining title author and authors we can see that some titles can have more than one author, thus, they share royalties

In [16]:
%%sql
Select *
from titleauthor ta inner join authors a on a.au_id = ta.au_id

order by title_id
limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('213-46-8915', 'BU1032', 2, 40, '213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1),
 ('409-56-7008', 'BU1032', 1, 60, '409-56-7008', 'Bennet', 'Abraham', '415 658-9932', '6223 Bateman St.', 'Berkeley', 'CA', '94705', 1),
 ('267-41-2394', 'BU1111', 2, 40, '267-41-2394', "O'Leary", 'Michael', '408 286-2428', '22 Cleveland Av. #14', 'San Jose', 'CA', '95128', 1),
 ('724-80-9391', 'BU1111', 1, 60, '724-80-9391', 'MacFeather', 'Stearns', '415 354-7128', '44 Upland Hts.', 'Oakland', 'CA', '94612', 1),
 ('213-46-8915', 'BU2075', 1, 100, '213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1)]

In [17]:
## Start joining tables

In [18]:
%%sql
Select *
from authors a
left join titleauthor ta on a.au_id = ta.au_id
inner join titles t on ta.title_id = t.title_id	
left join sales s on t.title_id = s.title_id

limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('172-32-1176', 'White', 'Johnson', '408 496-7223', '10932 Bigge Rd.', 'Menlo Park', 'CA', '94025', 1, '172-32-1176', 'PS3333', 1, 100, 'PS3333', 'Prolonged Data Deprivation: Four Case Studies', 'psychology', '0736', 19.99, 2000, 10, 4072, 'What happens when the data runs dry?  Searching evaluations of information-shortage effects.', '1991-06-12 00:00:00', '7131', 'P3087a', '1993-05-29 00:00:00', 15, 'Net 60', 'PS3333'),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1, '213-46-8915', 'BU1032', 2, 40, 'BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00', '6380', '6871', '1994-09-14 00:00:00', 5, 'Net 60', 'BU1032'),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1, '213-46-8915', 'BU1032', 2, 40, 'BU1032', "The Busy Executive's Database Guide", 'business', '1389', 19.99, 5000, 10, 4095, 'An overview of available database systems with emphasis on common business applications. Illustrated.', '1991-06-12 00:00:00', '8042', '423LL930', '1994-09-14 00:00:00', 10, 'ON invoice', 'BU1032'),
 ('213-46-8915', 'Green', 'Marjorie', '415 986-7020', '309 63rd St. #411', 'Oakland', 'CA', '94618', 1, '213-46-8915', 'BU2075', 1, 100, 'BU2075', 'You Can Combat Computer Stress!', 'business', '0736', 2.99, 10125, 24, 18722, 'The latest medical and psychological techniques for living with the electronic office. Easy-to-understand explanations.', '1991-06-30 00:00:00', '7896', 'X999', '1993-02-21 00:00:00', 35, 'ON invoice', 'BU2075'),
 ('238-95-7766', 'Carson', 'Cheryl', '415 548-7723', '589 Darwin Ln.', 'Berkeley', 'CA', '94705', 1, '238-95-7766', 'PC1035', 1, 100, 'PC1035', 'But Is It User Friendly?', 'popular_comp', '1389', 22.95, 7000, 16, 8780, "A survey of software for the naive user, focusing on the 'friendliness' of each.", '1991-06-30 00:00:00', '8042', 'QA879.1', '1993-05-22 00:00:00', 30, 'Net 30', 'PC1035')]

### Step 1

In [39]:
%%sql
Select t.title_id as 'TITLE ID', a.au_id as 'Author ID', t.price * s.qty * t.royalty/100 * royaltyper/100 as 'SALES_ROYALTIES'
from authors a
left join titleauthor ta on a.au_id = ta.au_id
inner join titles t on ta.title_id = t.title_id	
left join sales s on t.title_id = s.title_id

limit 20

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('PS3333', '172-32-1176', 29.984999999999996),
 ('BU1032', '213-46-8915', 3.9979999999999993),
 ('BU1032', '213-46-8915', 7.995999999999999),
 ('BU2075', '213-46-8915', 25.116000000000003),
 ('PC1035', '238-95-7766', 110.16),
 ('BU1111', '267-41-2394', 11.95),
 ('TC7777', '267-41-2394', 8.994),
 ('BU7832', '274-80-9391', 29.984999999999996),
 ('BU1032', '409-56-7008', 5.996999999999999),
 ('BU1032', '409-56-7008', 11.993999999999998),
 ('PC8888', '427-17-2319', 50),
 ('TC7777', '472-27-2349', 8.994),
 ('PC9999', '486-29-1786', None),
 ('PS7777', '486-29-1786', 19.975),
 ('TC4203', '648-92-1872', 33.46),
 ('TC7777', '672-71-3249', 11.992),
 ('MC2222', '712-45-1867', 23.987999999999996),
 ('MC3021', '722-51-5454', 13.455),
 ('MC3021', '722-51-5454', 8.073),
 ('BU1111', '724-80-9391', 17.925)]

### Step 2

In [56]:
%%sql
Select t.title_id as 'TITLE ID', a.au_id as 'Author ID', ifnull(round(t.price * s.qty * t.royalty/100 * royaltyper/100,2),0) as 'SALES_ROYALTIES'
from authors a
left join titleauthor ta on a.au_id = ta.au_id
inner join titles t on ta.title_id = t.title_id	
left join sales s on t.title_id = s.title_id

group by t.title_id, a.au_id
order by t.title_id, a.au_id

limit 20

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('BU1032', '213-46-8915', 4.0),
 ('BU1032', '409-56-7008', 6.0),
 ('BU1111', '267-41-2394', 11.95),
 ('BU1111', '724-80-9391', 17.93),
 ('BU2075', '213-46-8915', 25.12),
 ('BU7832', '274-80-9391', 29.99),
 ('MC2222', '712-45-1867', 23.99),
 ('MC3021', '722-51-5454', 8.07),
 ('MC3021', '899-46-2035', 2.69),
 ('PC1035', '238-95-7766', 110.16),
 ('PC8888', '427-17-2319', 50.0),
 ('PC8888', '846-92-7186', 50.0),
 ('PC9999', '486-29-1786', 0),
 ('PS1372', '724-80-9391', 10.8),
 ('PS1372', '756-30-7391', 32.39),
 ('PS2091', '899-46-2035', 1.97),
 ('PS2091', '998-72-3567', 1.97),
 ('PS2106', '998-72-3567', 17.0),
 ('PS3333', '172-32-1176', 29.99),
 ('PS7777', '486-29-1786', 19.98)]

### Step 3

In [44]:
%%sql
Select advance
from titles

limit 5

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[(5000,), (5000,), (10125,), (5000,), (0,)]

#### Step 3 Solution

In [58]:
%%sql
Select a.au_id as 'Author ID', ifnull(round(t.advance+(t.price * s.qty * t.royalty/100 * royaltyper/100),2),0) as 'PROFIT'
from authors a
left join titleauthor ta on a.au_id = ta.au_id
inner join titles t on ta.title_id = t.title_id	
left join sales s on t.title_id = s.title_id

group by t.title_id, a.au_id
order by PROFIT desc

limit 3

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('722-51-5454', 15008.07),
 ('899-46-2035', 15002.69),
 ('213-46-8915', 10150.12)]

## Challenge 2

In [59]:
%%sql
CREATE TABLE 'most_profiting_authors' as

Select a.au_id as 'Author ID', ifnull(round(t.advance+(t.price * s.qty * t.royalty/100 * royaltyper/100),2),0) as 'PROFIT'
from authors a
left join titleauthor ta on a.au_id = ta.au_id
inner join titles t on ta.title_id = t.title_id	
left join sales s on t.title_id = s.title_id

group by t.title_id, a.au_id
order by PROFIT desc

limit 3

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[]

In [60]:
%%sql
Select *
from most_profiting_authors

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('722-51-5454', 15008.07),
 ('899-46-2035', 15002.69),
 ('213-46-8915', 10150.12)]

In [61]:
%%sql
Select name 
from sqlite_master
where type='table'

 * sqlite:////Users/nestormirandabaez/Ironhack/Module_1/Week_8/20-lab-sql-select/publications.db
Done.

[('authors',),
 ('discounts',),
 ('employee',),
 ('jobs',),
 ('pub_info',),
 ('publishers',),
 ('roysched',),
 ('sales',),
 ('stores',),
 ('titleauthor',),
 ('titles',),
 ('most_profiting_authors',)]